#summary One-sentence summary of this page.

= Alzheimer's Disease (Diseasesome) =

{{{
SELECT DISTINCT ?s WHERE {
  ?s rdfs:label ?label .
  filter regex(?label, "^Alzheimer") 
}
LIMIT 10
}}}


Result:
{{{
http://www4.wiwiss.fu-berlin.de/diseasome/resource/diseases/74
}}}

A query about disease/74 also returns genes associated with the disease (diseasome:associatedGene) and possible drugs (diseasome:possibleDrug).


= Drugs possibly targeting at this disease (DrugBank)=
SELECT DISTINCT * WHERE {
  ?drug drugbank:possibleDiseaseTarget <http://www4.wiwiss.fu-berlin.de/diseasome/resource/diseases/74> .
}
LIMIT 100

78 drugs were returned.

= Exhibit Drugs associated with AD =
http://rodos.zoo.ox.ac.uk/tcmdata/exhibit_drugs/exhibit_medicine.html